experiments/02_biphasic_heartbeat/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment  Biphasic Pulsatile Heartbeat in a 1 mm Diameter Artery02 
//
// Inlet:  parabolic profile scaled by Q(t)codedFixedValue 
// 
// and the velocity profile is parabolic at every instant (quasi-Poiseuille).// Since the Womersley number 
// The full Womersley solution collapses to:
//
 ())r/)r
//
// Q(t) is the Holdsworth CCA biphasic waveform scaled to 1 mm artery via
//// Murray's cube law (
// Waveform source: Holdsworth et al. (1999), Physiological Measurement,
//   vol. 20, pp. 240, common carotid artery, 17 subjects, 3560 cycles.219
//   Scaled to T = 0.857 s (70 bpm) by time-compression (0.857/0.917).
//   BIPHASIC: forward flow throughout, no reversal.
//    3.93 Peak Q_mean (dicrotic notch dip at ~43% of cycle). 
//
// The 50-point table below was generated by assets/scripts/generate_qt_waveforms.py.
// Q_norm = Q(t)/Q_mean; use Q_norm  Q_mean to get Q(t).
//
// Outlet: zeroGradient (no reversal expected in biphasic waveform).

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            biphasicParabolicInlet;

        code
        #{
 Physical constants             // 
            const scalar T_     = 0.857;     // cardiac period [s] (70 bpm)
            const scalar R0_    = 0.0005;    // vessel radius [m]
            const scalar A_     = M_PI * R0_ * R0_;  // cross-section area []]m
            // Q_mean_1mm = 6e-6             // Mean (0.5/3.   = 2.404e-8 ///sm15) volumetric flow [///s]: Holdsworth CCA scaled to 1 mm via Murray m
            const scalar Q_mean = 2.404e-8;

            // Holdsworth CCA biphasic  Q_norm = Q(t)/Q_meanwaveform 
            // Digitized from Holdsworth et al. (1999) Fig. 11 / Table 4
            // Scaled to T=0.857s (70 bpm) via time-compression (0.857/0.917).
            // 50 uniform points over [0, T]. Generated by generate_qt_waveforms.py.
            const int N_t = 50;
            const scalar t_table[50] = {
                0.0000, 0.0175, 0.0349, 0.0524, 0.0698,
                0.0873, 0.1047, 0.1222, 0.1396, 0.1571,
                0.1745, 0.1920, 0.2094, 0.2269, 0.2443,
                0.2618, 0.2793, 0.2967, 0.3142, 0.3316,
                0.3491, 0.3665, 0.3840, 0.4014, 0.4189,
                0.4363, 0.4538, 0.4712, 0.4887, 0.5061,
                0.5236, 0.5411, 0.5585, 0.5760, 0.5934,
                0.6109, 0.6283, 0.6458, 0.6632, 0.6807,
                0.6981, 0.7156, 0.7330, 0.7505, 0.7679,
                0.7854, 0.8029, 0.8203, 0.8378, 0.8570
            };
            // Q_norm values (biphasic,   no flow reversal)0 always 
            const scalar Q_table[50] = {
                0.4000, 0.4150, 0.4350, 0.4600, 0.5200,
                0.6500, 1.2500, 2.1500, 3.7500, 3.9300,
                3.5000, 2.8000, 2.0000, 1.4000, 1.0500,
                0.8000, 0.6500, 0.5500, 0.4700, 0.4000,
                0.2500, 0.0750, 0.1500, 0.3500, 0.5500,
                0.6200, 0.6300, 0.6100, 0.5900, 0.5700,
                0.5500, 0.5300, 0.5100, 0.4900, 0.4800,
                0.4700, 0.4600, 0.4500, 0.4450, 0.4400,
                0.4350, 0.4300, 0.4250, 0.4200, 0.4180,
                0.4140, 0.4100, 0.4060, 0.4020, 0.4000
            };

            // Get current simulation time, wrap to [0, T_)
            const scalar t_    = this->db().time().timeOutputValue();
            const scalar t_mod = fmod(t_, T_);

            // Linear interpolation in the waveform table
            scalar Q_norm = Q_table[0];
            for (int i = 0; i < N_t - 1; i++)
            {
                if (t_mod >= t_table[i] && t_mod < t_table[i+1])
                {
                    scalar frac = (t_mod - t_table[i])
                                / (t_table[i+1] - t_table[i]);
                    Q_norm = Q_table[i] + frac * (Q_table[i+1] - Q_table[i]);
                    break;
                }
            }

            const scalar Q_t      = Q_mean * Q_norm;
            const scalar U_mean_t = Q_t / A_;

            // Set parabolic velocity profile on each inlet face
            const vectorField& Cf = patch().Cf();
            forAll(Cf, faceI)
            {
                const scalar y = Cf[faceI].y();
                const scalar z = Cf[faceI].z();
                const scalar r = Foam::sqrt(y*y + z*z);
                const scalar u = 2.0 * U_mean_t * (1.0 - (r*r)/(R0_*R0_));
                // Clamp  0: biphasic waveform is always forward flowto 
                operator[](faceI) = vector(Foam::max(u, scalar(0)), 0.0, 0.0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
