experiments/02_biphasic_heartbeat/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// pimpleFoam uses KINEMATIC pressure: p_kin = p_physical / rho  [m²/s²]
//
// Velocity-driven setup: pressure is NOT prescribed at the inlet.
// The outlet is held at gauge zero; the solver computes the time-varying
// pressure drop required to sustain the pulsatile velocity.
//
// inletOutlet is used at the inlet to allow a consistent pressure field
// when back-flow is absent (zeroGradient) while protecting against
// spurious oscillations.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
